[
  {
    "Name": "Athena Aktipis",
    "Bio": "Athena Aktipis, PhD., is an Assistant Professor in the Psychology Department at Arizona State University and Co-Director of the Human Generosity Project. Her work on the applications of cooperation theory to human sharing, cancer, infectious disease and obesity have been covered in the New York Times, National Public Radio, and Newsweek. Dr. Aktipis is the author of the forthcoming book from Princeton University Press, Evolution in the Flesh: Cancer and the Transformation of Life.",
    "Web Link 1": "http://www.athenaaktipis.org/",
    "Web Link 2": "http://www.aktipislab.org/"
  },
  {
    "Name": "Braden Allenby",
    "Bio": "Braden Allenby is President's Professor of Civil, Environmental, and Sustainable Engineering; Lincoln Professor of Engineering and Ethics; Senior Sustainability Scientist; and co-chair of the Weaponized Narrative Initiative, and of the Moral Injury Initiative, at the Center for the Future of War, at Arizona State University. His latest books include Future Conflict and Emerging Technologies (2016), and Weaponized Narrative: The New Battlespace (a collection of essays co-edited with Joel Garreau, released in 2017).",
    "Web Link 1": "https://isearch.asu.edu/profile/744560",
    "Web Link 2": ""
  },
  {
    "Name": "Ariel Anbar",
    "Bio": "Ariel Anbar is the director of the Center for Education Through eXploration at Arizona State University, where he is a President's Professor in the School of Earth and Space Exploration, and the School of Molecular Sciences. He is a scientist and educator interested in Earth's evolution as an inhabited world, and the prospects for life beyond.",
    "Web Link 1": "http://www.anbarlab.org/",
    "Web Link 2": "https://isearch.asu.edu/profile/703187"
  },
  {
    "Name": "Samuel Arbesman",
    "Bio": "Samuel Arbesman is a complexity scientist, whose work focuses on the nature of scientific and technological change. He is currently Scientist in Residence at Lux Capital. He is also a Senior Fellow of the Silicon Flatirons Center for Law, Technology, and Entrepreneurship at the University of Colorado Boulder and Research Fellow at the Long Now Foundation. He is the author of two award-winning books, Overcomplicated: Technology at the Limits of Comprehension (2016) and The Half-Life of Facts (2012). He completed a PhD in computational biology at Cornell University in 2008.",
    "Web Link 1": "http://www.arbesman.net/",
    "Web Link 2": "https://twitter.com/arbesman"
  },
  {
    "Name": "Miguel Astor-Aguilera",
    "Bio": "Miguel Astor-Aguilera (PhD Anthropology, University at Albany/SUNY) is an Associate Professor at Arizona State University whose scholarship concentrates on material culture and socio-religious theory. He specializes in Mesoamerican ontology and cross-cultural personhood issues. His work currently focuses on Maya ritual specialists in the Yucatan peninsula and their healing rituals as related to their ecological %u201Canimistic%u201D environment. Astor-Aguilera teaches Religious Studies courses at ASU in the School of Historical, Philosophical, and Religious Studies.",
    "Web Link 1": "https://isearch.asu.edu/profile/618201",
    "Web Link 2": ""
  },
  {
    "Name": "Bob Beard",
    "Bio": "Bob Beard is the Public Engagement Strategist for the Center for Science and the Imagination at Arizona State University, where he produces content, public programming, exhibitions, and experiences at the intersection of science, engineering, and the humanities. Prior to joining CSI, he worked in the media industry with stints at CBS Radio, Village Voice Media, and most recently PBS, where he developed national brand, communication, and outreach strategies. His research interests focus on performance, identity, and authenticity in fandoms and other communities of practice.",
    "Web Link 1": "https://www.linkedin.com/in/bobbeard/",
    "Web Link 2": "https://twitter.com/bob_beard"
  },
  {
    "Name": "Dominic Berry",
    "Bio": "Dominic is a Research Fellow on the Engineering Life project (ERC grant number 616510-ENLIFE) at the University of Edinburgh. His research integrates the history, philosophy, and sociology of biology and biotechnology from 1900 to the present, concentrating on heredity, agriculture, and biological engineering.",
    "Web Link 1": "https://dominicberry.wordpress.com/",
    "Web Link 2": "https://twitter.com/HPSGlonk"
  },
  {
    "Name": "Ron Broglio",
    "Bio": "Ron Broglio is an associate professor in the Department of English at Arizona State University. His research focuses on how philosophy and aesthetics can help us rethink the relationship between humans and the environment. His book Surface Encounters: Thinking with Animals and Art (2011) asks what is an animal phenomenology and how might it be thought through art, while Technologies of the Picturesque: British Art, Poetry, and Instruments 1750-1830 (2008) considers the influence of technology in British landscape aesthetics.",
    "Web Link 1": "www.public.asu.edu/~rbroglio",
    "Web Link 2": "https://www.upress.umn.edu/book-division/books/surface-encounters"
  },
  {
    "Name": "Sara Brownell",
    "Bio": "Sara Brownell is a neuroscientist turned full-time education researcher, who teaches undergraduate biology while studying biology education. As a science faculty member with education specialty, she uses both qualitative and quantitative data to better understand how undergraduate biology students learn and how instructors can develop more effective ways to teach.",
    "Web Link 1": "https://sols.asu.edu/people/sara-brownell",
    "Web Link 2": "http://sebbers.wixsite.com/biology-ed-lab"
  },
  {
    "Name": "Noa Bruhis",
    "Bio": "Noa Bruhis is a Ph.D. student in the School for the Future of Innovation in Society at Arizona State University. Her prior work has ranged from mathematical modeling of hydrologic systems to the development of an in-situ nitrate sensor for agricultural runoff. Her current work includes evaluating nature-based tourism as informal education, and the opportunities of citizen science.",
    "Web Link 1": "https://www.linkedin.com/in/noa-bruhis-8a73b64b/",
    "Web Link 2": ""
  },
  {
    "Name": "Carlos Castillo-Chavez",
    "Bio": "Carlos Castillo-Chavez is a Regents' Professor, a Joaquin Bustoz Jr. Professor of Mathematical Biology, and a Distinguished Sustainability Scientist at Arizona State University. He is also the rector of Yachay University of Experimental Technical Research in Ecuador. He has co-authored more than 200 publications and edited several volumes of research articles. He co-authored a textbook in Mathematical Biology (2001, second edition in 2012), and co-edited a volume on the use of mathematical models in homeland security, and various other works highlighting his interests in the applications of mathematics in emerging and re-emerging diseases.",
    "Web Link 1": "https://isearch.asu.edu/profile/566521",
    "Web Link 2": "https://en.wikipedia.org/wiki/Carlos_Castillo-Chavez"
  },
  {
    "Name": "Adam Chodorow",
    "Bio": "Adam Chodorow teaches tax and business law at the Sandra Day O'Connor College of Law at Arizona State University. He writes on a wide variety of tax topics, ranging from the tax policy inherent in religious tithing practices to the appropriate tax treatment of virtual currencies like Bitcoin. In addition to his serious academic work, he contributes op-eds and commentary on topical tax issues to Slate, Marketplace, and other popular press outlets. In the realm of the supernatural, he is best known for his Iowa Law Review article \"Death and Taxes and Zombies,\" which explores the real-world tax consequences of the zombie apocalypse.",
    "Web Link 1": "https://isearch.asu.edu/profile/709824",
    "Web Link 2": ""
  },
  {
    "Name": "Robert Cook-Deegan",
    "Bio": "Robert Cook-Deegan is a professor at the School for the Future of Innovation in Society and Consortium for Science, Policy & Outcomes at Arizona State University. He founded and directed Duke's Center for Genome Ethics, Law & Policy from 2002- 2012, and Duke-in-Washington through June 2016. Before Duke, he worked at the National Academies of Science, Engineering and Medicine from 1991-2002, the National Center for Human Genome Research from 1989-1990, and the congressional Office of Technology Assessment from 1982-1988. He earned his MD from the University of Colorado and his BA in chemistry from Harvard University. He is the author of The Gene Wars: Science, Politics, and the Human Genome and over 250 other publications.",
    "Web Link 1": "https://isearch.asu.edu/profile/2783639",
    "Web Link 2": "http://dnapatents.georgetown.edu/genomearchive/GeneWars.htm"
  },
  {
    "Name": "Mary Drago",
    "Bio": "Following a career in higher education and the healthcare industry, Mary Drago, PhD is the President of Arizona Bioethics Network, a community organization of health care and human service professionals. Mary holds a MA in Biomedical and Health Ethics from Arizona State University (2011) and a PhD in Bioethics, Policy, and Law from Arizona State University (2016.) Mary's focus is on disparities in health outcomes and healthcare access, and cultural competency of health providers.",
    "Web Link 1": "https://www.linkedin.com/in/mary-drago-1164535/",
    "Web Link 2": "https://twitter.com/MkgdAZ"
  },
  {
    "Name": "Lawrence Dritsas",
    "Bio": "Lawrence Dritsas began his studies in the United States and has interdisciplinary training in the humanities and natural sciences. He volunteered as a secondary school biology teacher with the U.S. Peace Corps in Malawi in the late 1990s. His PhD thesis (at the University of Edinburgh) focused on David Livingstone's Zambesi Expedition (1858%u201364). His research follows multiple paths as he pursues historical geographies of scientific knowledge, museum collections, and science fiction.",
    "Web Link 1": "http://www.sps.ed.ac.uk/staff/science_technology_and_innovation_studies/dritsas_l",
    "Web Link 2": ""
  },
  {
    "Name": "Joey Eschrich",
    "Bio": "Joey Eschrich is the editor and program manager at the Center for Science and the Imagination at Arizona State University. He is also an assistant director for Future Tense, a partnership of ASU, Slate, and New America that explores emerging technologies, public policy, and culture. He is the co-editor of the books Overview: Stories in the Stratosphere and Everything Change: An Anthology of Climate Fiction.",
    "Web Link 1": "https://joeyeschrich.tumblr.com",
    "Web Link 2": "https://twitter.com/joeyesch"
  },
  {
    "Name": "Ed Finn",
    "Bio": "Ed Finn is the founding director of the Center for Science and the Imagination at Arizona State University, where he is an assistant professor with a joint appointment in the School of Arts, Media and Engineering and the Department of English. Ed's research and teaching explore digital narratives, contemporary culture, and the intersection of the humanities, arts, and sciences. He is the author of What Algorithms Want: Imagination in the Age of Computing (2017) and coeditor of Hieroglyph: Stories and Visions for a Better Future (2014). He holds a B.A. from Princeton University and an M.A. and Ph.D. from Stanford University.",
    "Web Link 1": "http://edfinn.net/",
    "Web Link 2": "https://twitter.com/zonal"
  },
  {
    "Name": "Mary Margaret Fonow",
    "Bio": "Mary Margaret Fonow is the Norton and Ramsey Professor of Social Transformation and Women and Gender Studies at Arizona State University. Her research and teaching interests include feminist epistemology, theory and methodology and the labor movement. She is the author of Union Women: Forging Feminism in the United Steelworkers of America and Making Feminist Politics: Transnational Alliances between Women and Labor. She teaches a course on transformational leadership and embodied activism.",
    "Web Link 1": "https://isearch.asu.edu/profile/748866",
    "Web Link 2": ""
  },
  {
    "Name": "Joel Gereboff",
    "Bio": "Joel Gereboff is an associate professor in the School of Historical, Philosophical and Religious Studies at Arizona State University. He holds a B.A. from New York University and a Ph.D. from Brown University.",
    "Web Link 1": "https://isearch.asu.edu/profile/10502",
    "Web Link 2": ""
  },
  {
    "Name": "Eileen Gunn",
    "Bio": "Eileen Gunn is a writer and editor based in Seattle. She is the author of two story collections: Questionable Practices (Small Beer Press, 2014) and Stable Strategies and Others (Tachyon Publications, 2004). Her fiction has received the Nebula Award in the U.S. and the Sense of Gender Award in Japan, and been nominated for the Hugo, Philip K. Dick, and World Fantasy awards and short-listed for the James Tiptree, Jr. award. Gunn was the editor/publisher of the influential Infinite Matrix webzine, 2001-2008.",
    "Web Link 1": "http://www.eileengunn.com/",
    "Web Link 2": "https://twitter.com/eileen_gunn"
  },
  {
    "Name": "David H. Guston",
    "Bio": "David H. Guston is is professor and founding director of the School for the Future of Innovation in Society at Arizona State University. His Between Politics and Science (2000) was awarded the 2002 Don K. Price Prize by the American Political Science Association for best book in science and technology policy. He is the founding editor of the Journal of Responsible Innovation. A fellow of the American Association for the Advancement of Science, he cochaired the 2008 Gordon Research Conference on Science and Technology Policy, %u201CGoverning Emerging Technologies.%u201D He holds a B.A. from Yale University and a Ph.D. from the Massachusetts Institute of Technology.",
    "Web Link 1": "https://isearch.asu.edu/profile/756359",
    "Web Link 2": "https://scholar.google.com/citations?user=NIkenGUAAAAJ"
  },
  {
    "Name": "Judith Guston",
    "Bio": "Judith Guston is the Director of Collections at Philadelphia's Rosenbach Museum, where she most recently curated Frankenstein & Dracula: Gothic Monsters, Modern Science. She has curated or co-curated over 70 exhibitions based on the museum's collections, which span from antiquity through Modernism, and has created innovative interpretive programming around the collections. She hopes to engage audiences in conversations around the contemporary meaning of the art, history, and literature of the past.",
    "Web Link 1": "https://rosenbach.org/",
    "Web Link 2": ""
  },
  {
    "Name": "Kim Hammond",
    "Bio": "Kim Hammond is a cultural geographer most recently based at The Open University as a researcher/project manager on three AHRC-funded projects: Stories of Change, Earth in Vision, and Listening to Climate Change. These benefit from Kim's first career as an environmental scientist and her more recent engagement in the cultural dimensions of environmental change. She has published both as a scientist and a cultural geographer. She has coproduced and authored three interactive multimedia e-books.",
    "Web Link 1": "http://www.open.edu/openlearn/earthinvision",
    "Web Link 2": "http://journals.sagepub.com/doi/abs/10.1191/14744744004eu301oa"
  },
  {
    "Name": "Chris Hanlon",
    "Bio": "Christopher Hanlon's writings on romantic and transatlantic literature have appeared in the New York Times, American Literature, American Literary History, and Nineteenth Century Literature, among other venues. His books, America's England (2013) and Emerson's Memory Loss (2018), are published by Oxford University Press. Hanlon teaches literature at Arizona State University.",
    "Web Link 1": "https://newcollege.asu.edu/christopher-hanlon",
    "Web Link 2": ""
  },
  {
    "Name": "Dehlia Hannah",
    "Bio": "Dehlia Hannah is Research Curator for the Centre for Environmental Humanities at Aarhus University. She holds a PhD in Philosophy from Columbia University, with specializations in philosophy of science and aesthetic theory. Her current curatorial project and forthcoming book A Year Without a Winter revisits the environmental conditions under which the novel Frankenstein was written in the aftermath of the eruption of Mount Tambora in order to reframe our contemporary climate crisis. A transmedia thought experiment bringing together science fiction, scenario planning, biogeochemistry, environmental history, visual art, and architecture, A Year Without a Winter proliferates new narrative futures for uncertain climes.",
    "Web Link 1": "http://dehliahannah.com",
    "Web Link 2": "http://ayearwithoutawinter.org"
  },
  {
    "Name": "Sean A. Hays",
    "Bio": "Sean A. Hays is an instructional designer for Endurance International Group and a postdoctoral fellow at the Centre for the Study of the Sciences and the Humanities at the University of Bergen. He holds a Ph.D. in Political Science from Arizona State University. His writing has been published in the Yearbook of Nanotechnology in Society, Volume III (2012), the Encyclopedia on Nanoscience in Society (2010), the Journal of Science and Technology Policy, and the Review of Policy Research.",
    "Web Link 1": "https://www.linkedin.com/in/sean-hays-322a1393/",
    "Web Link 2": ""
  },
  {
    "Name": "Amanda Holderread Heggen",
    "Bio": "Amanda Holderread Heggen has a PhD in Special Education from the University of New Mexico. Her dissertation, The Role of Disability in Buffy the Vampire Slayer, examined the intersection of theories of horror art with the social construction of disability.",
    "Web Link 1": "",
    "Web Link 2": ""
  },
  {
    "Name": "Nicole Herbots",
    "Bio": "Nicole Herbots is a Professor Emerita in the Department of Physics at Arizona State University.",
    "Web Link 1": "https://isearch.asu.edu/profile/41229",
    "Web Link 2": ""
  },
  {
    "Name": "Adam Hosein",
    "Bio": "Adam Hosein is an associate professor of Philosophy at Northeastern University. He works mainly on issues of justice, including immigrant rights, racial profiling, and sex-stereotyping. He is also interested in ways fiction can help us understand the moral world. He holds a BA in Philosophy, Politics, and Economics from Merton College, Oxford, and a PhD in philosophy from MIT.",
    "Web Link 1": "https://www.northeastern.edu/cssh/faculty/adam-hosein",
    "Web Link 2": "https://twitter.com/philunderground"
  },
  {
    "Name": "Andrew Dana Hudson",
    "Bio": "Andrew Dana Hudson is an anti-capitalist organizer and speculative fiction writer at ASU's School of Sustainability. His story %u201CSunshine State%u201D won the ASU Imagination and Climate Future Initiative's 2016 Climate Fiction Contest.",
    "Web Link 1": "https://twitter.com/AndrewDHudson",
    "Web Link 2": ""
  },
  {
    "Name": "Allison Kavey",
    "Bio": "Allison Kavey is an associate professor of History at CUNY John Jay College of Criminal Justice and the CUNY Graduate Center. Her research interests include early modern history of science and magic, and she is currently working on a book about Agrippa von Nettesheim's magical cosmology. She recently co-authored a book with Lester Friedman, Monstrous Progeny: A History of the Frankenstein Narratives (Rutgers University Press, 2016). Her other publications include Books of Secrets: Natural Philosophy in England, 1550-1600, and the edited collections Imagining Early Modern Histories (Ashgate, 2015) and World-Building and the Early Modern Imagination (Palgrave, 2010).",
    "Web Link 1": "http://www.jjay.cuny.edu/faculty/allison-kavey",
    "Web Link 2": ""
  },
  {
    "Name": "Jonathon Keats",
    "Bio": "Jonathon Keats is an experimental philosopher, writer and artist. He is the author of six books, most recently You Belong to the Universe: Buckminster Fuller and the Future, published by Oxford University Press. His conceptually-driven interdisciplinary art projects, hosted by institutions ranging from Arizona State University to the Los Angeles County Museum of Art, include the construction of a photosynthetic restaurant for plants and the development of cameras that take thousand-year-long exposures, documenting the long-term effects of climate change.",
    "Web Link 1": "https://www.modernisminc.com/artists/Jonathon_KEATS/",
    "Web Link 2": "https://twitter.com/jonathonkeats"
  },
  {
    "Name": "Douglas Kelley",
    "Bio": "Douglas Kelley is Professor of Communication Studies and a Lincoln Professor of Applied Ethics at Arizona State University. Much of his research has focused on Marital Communication, resulting in a book by the same name published in 2012. His 1998 study, The Communication of Forgiveness, is the seminal piece of research on the communication of forgiveness, and launched two decades of work focusing on various forgiveness processes, culminating with the two-time award-winning book Communicating Forgiveness (2008).",
    "Web Link 1": "https://isearch.asu.edu/profile/157",
    "Web Link 2": "https://scholar.google.com/citations?user=pgcF3rUAAAAJ&hl=en"
  },
  {
    "Name": "Sally Kitch",
    "Bio": "Sally L. Kitch is University and Regents' Professor of Women's and Gender Studies, founding Director of the Institute for Humanities Research and of the Humanities Lab at ASU. She is the author of several books, including Contested Terrain: Reflections with Afghan Women Leaders (2014), The Specter of Sex: The Gendered Foundations of Racial Formation in the U.S. (2009), and Higher Ground: From Utopianism to Realism in American Feminist Thought (2000).",
    "Web Link 1": "https://isearch.asu.edu/profile/970381",
    "Web Link 2": "http://sallykitch.net/"
  },
  {
    "Name": "Joel A. Klein",
    "Bio": "Joel A. Klein is a Haas Postdoctoral Fellow at the Chemical Heritage Foundation in Philadelphia, Pennsylvania. He holds a Ph.D. in the History and Philosophy of Science, with Renaissance Studies minor, from Indiana University. His writing has appeared in the journal Ambix and the book Medicine, Natural Philosophy and Religion in Post-Reformation Scandinavia.",
    "Web Link 1": "http://joelaklein.com/",
    "Web Link 2": ""
  },
  {
    "Name": "Sheldon Krimsky",
    "Bio": "Sheldon Krimsky is Lenore Stern Professor of Humanities and Social Sciences in the Department of Urban & Environmental Policy & Planning in the School of Arts & Sciences and Adjunct Professor in Public Health and Community Medicine in the School of Medicine at Tufts University. He received a BS and MS in physics from Brooklyn College, CUNY and Purdue University respectively, an MA and PhD in philosophy at Boston University. He has authored, co-authored or edited 14 books and published over 200 papers.",
    "Web Link 1": "http://emerald.tufts.edu/~skrimsky/",
    "Web Link 2": ""
  },
  {
    "Name": "Stacey Kuznetsov",
    "Bio": "Stacey Kuznetsov is an assistant professor at the School of Arts, Media, and Engineering at Arizona State University. Her research explores the role of technology in collective efforts to construct knowledge and address issues. Her work applies Human Computer Interaction and design methods to the study of current and future systems for science and technology. She develops low-cost tools and bottom-up design methods for citizen science, community activism, and (DIY)biology. She holds a PhD from Carnegie Mellon University. Earlier, she worked for a small startup company (Google).",
    "Web Link 1": "https://isearch.asu.edu/profile/2532063",
    "Web Link 2": ""
  },
  {
    "Name": "JJ LaTourelle",
    "Bio": "JJ LaTourelle is a graduate student in the History and Philosophy of Science at Arizona State University. He holds a B.A. from the University of Pittsburgh, also in the History and Philosophy of Science.",
    "Web Link 1": "",
    "Web Link 2": ""
  },
  {
    "Name": "Devoney Looser",
    "Bio": "Devoney Looser is Professor of English at Arizona State University and the author or editor of seven books on literature by women. Her most recent is The Making of Jane Austen (Johns Hopkins University Press), which was named a Publishers Weekly Best Summer Book for Nonfiction in 2017. Devoney's recent writing on Austen has appeared in The Atlantic, the New York Times, Salon, The TLS, and Entertainment Weekly, and she's also had the opportunity to talk about Austen on CNN.",
    "Web Link 1": "http://www.devoneylooser.com/",
    "Web Link 2": "https://twitter.com/devoneylooser"
  },
  {
    "Name": "Arthur B. Markman",
    "Bio": "Arthur B. Markman is the Anabel Irion Worsham Centennial Professor of Psychology and Marketing at the University of Texas and Founding Director of the Program in the Human Dimensions of Organizations. He has written over 150 scholarly papers on topics including reasoning, decision making, and motivation. He brings insights from cognitive science to a broader audience through his blogs at Psychology Today and Fast Company as well as his radio show and podcast Two Guys on Your Head. Art has written several books including Smart Thinking, Smart Change, and Brain Briefs.",
    "Web Link 1": "https://liberalarts.utexas.edu/psychology/faculty/markman",
    "Web Link 2": "http://www.smartthinkingbook.com/"
  },
  {
    "Name": "Sean McCafferty",
    "Bio": "Sean McCafferty is an active duty officer in the US Army, currently earning a PhD at ASU's School for the Future of Innovation in Society. Sean has a BS in history from the U.S. Military Academy at West Point and an MA in history from Florida State University; he also taught military history at West Point. His research interests include complex socio-technological systems, their interaction with military systems, and avoiding future failure scenarios.",
    "Web Link 1": "https://futureofwar.asu.edu/people/sean-mccafferty",
    "Web Link 2": ""
  },
  {
    "Name": "Patrick McGurrin",
    "Bio": "Patrick McGurrin has a bachelor's degree in psychology from the University of Pittsburgh and a Ph.D. in neuroscience from Arizona State University. He uses noninvasive technologies to explore how the human brain plans and controls complex movement, and has growing interest in the ethics and use of such technologies for cognitive and physical enhancement.",
    "Web Link 1": "https://www.pmcgurrin.com/",
    "Web Link 2": "https://twitter.com/McGurrGurr"
  },
  {
    "Name": "April Miller",
    "Bio": "April Miller is an Honors Faculty Fellow at Barrett, The Honors College at Arizona State University. She is a scholar of film history and interdisciplinary modernism who holds a Ph.D. in English and Film Studies from The University of Rochester and an M.A. and B.A., Honors in English from the University of Alberta.",
    "Web Link 1": "https://barretthonors.asu.edu/honors-faculty/dr-april-miller",
    "Web Link 2": ""
  },
  {
    "Name": "Ben Minteer",
    "Bio": "Ben Minteer is professor of environmental ethics and conservation and the the Arizona Zoological Society Endowed Chair in the School of Life Sciences at Arizona State University. His work grapples with two big questions: What obligations do we have toward species and wildlands in a rapidly changing and increasingly human-shaped environment? And how can a better understanding of the American conservation tradition enhance our efforts to secure a biologically and culturally rich environmental future? He is the author of the books After Preservation: Saving American Nature in the Age of Humans (2015) and The Landscape of Reform: Civic Pragmatism and Environmental Thought in America (2009).",
    "Web Link 1": "http://www.benaminteer.com/",
    "Web Link 2": "https://sols.asu.edu/people/ben-minteer"
  },
  {
    "Name": "Peter Nagy",
    "Bio": "Peter is a media scholar with a master's degree in psychology from Eötvös Loránd University and a PhD in management from Corvinus University of Budapest. Before joining the Center for Science and the Imagination, Peter worked as a psychologist at a high school and as a research fellow at Central European University's Center for Data, Media and Society in Budapest, Hungary. Peter's research interests include the impact of communication technology on identity formation as well as the public understanding of science. His writing has appeared in the peer-reviewed journals Social Media + Society, Science and Engineering Ethics, and International Journal of Communication.",
    "Web Link 1": "https://asu.academia.edu/PeterNagy",
    "Web Link 2": "https://twitter.com/peternagy84"
  },
  {
    "Name": "Stephanie Naufel",
    "Bio": "Stephanie Naufel is a neural engineer at ECS Federal, LLC in Arlington, Virginia. She holds a Ph.D. in biomedical engineering from Northwestern University and an M.S. in biomedical engineering from Arizona State University.",
    "Web Link 1": "https://www.linkedin.com/in/snaufel/",
    "Web Link 2": ""
  },
  {
    "Name": "Annalee Newitz",
    "Bio": "Annalee Newitz is an editor at large at Ars Technica. Her work focuses on cultural impact of science and technology. She founded the science and science fiction blog io9.com, and is the author of Scatter, Adapt, and Remember: How Humans Will Survive a Mass Extinction. Her first novel, Autonomous, came out in September 2017. She has a Ph.D. in English and American Studies from the University of California, Berkeley, and was the recipient of a Knight Science Journalism Fellowship at MIT.",
    "Web Link 1": "https://www.techsploitation.com/",
    "Web Link 2": "https://twitter.com/Annaleen"
  },
  {
    "Name": "Nicole Piemonte",
    "Bio": "Nicole M. Piemonte is an assistant professor in the Department of Medical Education at Creighton University, School of Medicine, and academic consultant at St. Joseph's Hospital and Medical Center, Phoenix. She holds a Ph.D. in medical humanities from the Institute for the Medical Humanities at the University of Texas Medical Branch. She is the author of the book Afflicted: How Vulnerability Can Heal Medical Education and Practice (2018).",
    "Web Link 1": "https://mitpress.mit.edu/books/afflicted",
    "Web Link 2": "https://creighton.academia.edu/NicolePiemonte"
  },
  {
    "Name": "Corey Pressman",
    "Bio": "Corey is a strategist, anthropologist, and futurist. As vice president of adaptive strategies at Fiction, he generates, manages, and works on projects with organizations and companies large and small to help them envision and enact human-centered communication and innovation.  Corey is also a fellow of ASU's Center for Science and the Imagination, where he runs innovation workshops and develops classes on science fiction prototyping and futurism.",
    "Web Link 1": "http://coreypressman.com/",
    "Web Link 2": "https://twitter.com/cspressman"
  },
  {
    "Name": "Alecia Radatz",
    "Bio": "Alecia Radatz is a PhD student in the Human and Social Dimensions of Science and Technology program at Arizona State University. Her research focuses on how driverless vehicles might be designed to better incorporate people with different kinds of bodies, including those with disabilities. She also works for ASU measuring outcomes for the university's educational outreach initiatives and student services. Alecia's graduate educational background is in Political Science (MA) and Science and Technology Policy (MSTP).",
    "Web Link 1": "https://twitter.com/aradatz",
    "Web Link 2": "www.linkedin.com/in/alecia-radatz-8351a139"
  },
  {
    "Name": "Ramsey Eric Ramsey",
    "Bio": "Ramsey Eric Ramsey is the associate dean of Barrett, The Honors College at Arizona State University's West campus. He holds a Ph.D. from the Joint Program in Philosophy and Communication at Purdue University. He is the author of two books, Leaving Us to Wonder: An Essay on the Questions Science Can't Ask (2004, with biologist Linda Wiener) and The Long Path to Nearness (1998), a philosophical contribution to communication theory and ethics. He is also the editor of and contributor to the book Experiences Between Philosophy and Communication (2003).",
    "Web Link 1": "https://barretthonors.asu.edu/honors-faculty/dr-ramsey-eric-ramsey",
    "Web Link 2": "https://newcollege.asu.edu/ramsey-eric-ramsey"
  },
  {
    "Name": "Jason Scott Robert",
    "Bio": "Jason Scott Robert holds the Lincoln Chair in Ethics and serves as senior ethics advisor to the provost at Arizona State University. He is also director of ASU's Lincoln Center for Applied Ethics, and dean's distinguished professor in the School of Life Sciences. His teaching and research are at the intersection of bioethics and the philosophy of biology. He is the author of the book Embryology, Epigenesis and Evolution: Taking Development Seriously (2004). He holds a B.A. from Queen's University at Kingston and an M.A. and Ph.D. from McMaster University.",
    "Web Link 1": "https://sols.asu.edu/people/jason-robert",
    "Web Link 2": "https://www.jasonrobert.org/"
  },
  {
    "Name": "Hannah Rogers",
    "Bio": "Hannah Star Rogers is an Art and Science Studies scholar, curator, and poet. She received her MFA at Columbia University and her Ph.D. at Cornell University in Science & Technology Studies, where her research concerned the intersection of art and science, particularly critiques of science in contemporary art. Her scholarly publications have appeared in Configurations, Leonardo, Photomediations, and A New Synthesis.",
    "Web Link 1": "https://hannahstarrogers.wordpress.com/",
    "Web Link 2": ""
  },
  {
    "Name": "Kevin Sandler",
    "Bio": "Kevin Sandler is an associate professor and director of the Film and Media Studies Program at Arizona State University. He specializes in the contemporary U.S. media business, with a particular focus on censorship and animation. He is the author of The Naked Truth: Why Hollywood Doesn't Make X-Rated Movies (2007), the co-editor of Titanic: Anatomy of a Blockbuster (1999), and editor of Reading the Rabbit: Explorations in Warner Bros. Animation (1998). His upcoming book is about the history, artistry, and business of Scooby-Doo, from Duke University Press.",
    "Web Link 1": "https://isearch.asu.edu/profile/1250151",
    "Web Link 2": "https://twitter.com/kevinsandler"
  },
  {
    "Name": "Daniel Sarewitz",
    "Bio": "Daniel Sarewitz is Professor of Science and Society, and co-director and co-founder of the Consortium for Science, Policy, and Outcomes (CSPO), at Arizona State University. He is interested in relationships among knowledge, technology, uncertainty, disagreement, policy, and social outcomes. %u201CSaving Science,%u201D his analysis of the multiple challenges facing the scientific enterprise, appeared in The New Atlantis in August 2016. He is editor of Issues in Science and Technology, and a regular columnist for Nature.",
    "Web Link 1": "http://cspo.org/people/sarewitz-daniel/",
    "Web Link 2": "https://www.nature.com/search?author=sarewitz&order=relevance&page=1"
  },
  {
    "Name": "Pablo Schyfter",
    "Bio": "Pablo Schyfter is a lecturer in the School of Social and Political Science at the University of Edinburgh, with a focus on science, technology, and innovation studies. He holds a Ph.D. in Science Studies from the University of Edinburgh. He is the co-author of the book Synthetic Aesthetics: Investigating Synthetic Biology's Designs on Nature (2014), and his writing has appeared in journals including Social Epistemology, Studies in History and Philosophy of Biological and Biomedical Sciences, Engineering Studies, and Philosophy & Technology.",
    "Web Link 1": "http://www.sps.ed.ac.uk/staff/science_technology_and_innovation_studies/schyfter_pablo",
    "Web Link 2": "https://scholar.google.co.uk/citations?user=j-J0eB8AAAAJ&hl=en"
  },
  {
    "Name": "Verena Schulze Greiving",
    "Bio": "Verena Schulze Greiving is a postdoctoral researcher at the Science, Technology and Policy Studies group (University of Twente, The Netherlands). After a bachelor in chemistry, she followed a master in nanotechnology, and received her PhD for developing a microfluidic drug screening platform. Currently, Verena supports scientists to implement societal dimensions in their research and created the %u201CCTA toolbox.%u201D Additionally, she is studying the role of Responsible Research and Innovation in digital health care developments.",
    "Web Link 1": "https://utwente.nl/en/bms/steps/staff/schulzegreiving",
    "Web Link 2": "http://cta-toolbox.nl"
  },
  {
    "Name": "Richard C. Sha",
    "Bio": "Richard C. Sha is professor of Literature at American University, where he teaches courses in Romanticism, the emotions, and consciousness. His new book, Imagination and Science in Romanticism, is forthcoming from the Johns Hopkins University Press in August, 2018, and features two chapters on the Shelleys. He is also the author of Perverse Romanticism: Aesthetics and Sexuality in Britain, 1750-1832 (2009) and The Visual and Verbal Sketch in British Romanticism (1998), and co-editor of Romanticism and the Emotions (2014).",
    "Web Link 1": "https://www.american.edu/cas/faculty/rcsha.cfm",
    "Web Link 2": "https://american.academia.edu/RichardCSha"
  },
  {
    "Name": "Michelle N. Shiota",
    "Bio": "Michelle N. Shiota is an Associate Professor of Psychology at Arizona State University. She received her B.A. from Stanford University and her doctorate in Social/Personality Psychology from the University of California, Berkeley. Her research investigates positive emotions, emotion regulation, and emotion in close relationships. She is co-editor of the Handbook of Positive Emotions (2016), and co-author of the textbook Emotion (2017).",
    "Web Link 1": "https://isearch.asu.edu/profile/977684",
    "Web Link 2": "https://psychology.clas.asu.edu/research/labs/splat-lab-shiota"
  },
  {
    "Name": "Kerri Slatus",
    "Bio": "Kerri Slatus is a lecturer at Towson University in Marylan, and a visiting affiliate assistant professor at Loyola University Maryland. She holds a Ph.D. in English Literature from Arizona State University, an M.A. in Liberal Studies from the City University of New York, and a B.A. in English from the University of Rochester.",
    "Web Link 1": "https://www.linkedin.com/in/kslatus/",
    "Web Link 2": ""
  },
  {
    "Name": "Mike Stanford",
    "Bio": "Mike Stanford is an Honors Faculty Fellow, a licensed attorney, and a literary scholar with a particular interest in literature about the law. He holds a B.A. from Duke University and a Ph.D. in English literature from the University of Virginia. He is the editor, with David Kader, of Poetry of the Law from Chaucer to the Present (2010)%u2014the first anthology of law-related poetry published in the United States.",
    "Web Link 1": "https://barretthonors.asu.edu/honors-faculty/dr-michael-stanford",
    "Web Link 2": ""
  },
  {
    "Name": "William K. Storey",
    "Bio": "William K. Storey is a professor at Millsaps College in Jackson, Mississippi, where he was the 2013 Carnegie-CASE professor of the year. He researches and writes about the history of technology and empire-building. He is currently working on a study about Cecil Rhodes's vision for mining, farming, railroads, and telegraphy in Southern Africa.",
    "Web Link 1": "http://www.millsaps.edu/academics/history.php",
    "Web Link 2": "http://williamstorey.org/"
  },
  {
    "Name": "Jameien Taylor",
    "Bio": "Jameien Taylor is a PhD student in the Hugh Downs School of Human Communication. He holds an M.A. in Communication and a B.A. in Sociology from Arizona State University. He studies communication within interpersonal relationships. He is particularly interested in exploring the implications of kindness in conflict resolution and peacebuilding. Additionally, he is concerned with the ways people communicate kindness in various social roles, including parent, child, teacher, student, friend, stranger, and spouse.",
    "Web Link 1": "",
    "Web Link 2": ""
  },
  {
    "Name": "Nora S. Vaage",
    "Bio": "Nora S. Vaage is Assistant Professor in Philosophy of Art and Culture at Maastricht University, in the Netherlands. Her expertise is on the intersection between culture, society, and values. Nora's research interests include bio-art, DIY biology, cultural aspects of climate change, representations of smart technology, and ethics.",
    "Web Link 1": "https://www.maastrichtuniversity.nl/n.vaage",
    "Web Link 2": "https://twitter.com/norasvaage"
  },
  {
    "Name": "Steven Weiner",
    "Bio": "Steven Weiner is a PhD student in the School for the Future of Innovation in Society at Arizona State University. His interests include STEM education reform, innovative learning frameworks, and the future of schooling. Before starting his doctoral studies, Mr. Weiner served as the founding program director for CREATE at Arizona Science Center, a hybrid educational makerspace/community center. He has previous experience as a physics instructor at the middle school and high school levels.",
    "Web Link 1": "https://www.linkedin.com/in/smweiner/",
    "Web Link 2": ""
  },
  {
    "Name": "Damien Patrick Williams",
    "Bio": "Damien Patrick Williams has a master's degree in philosophy and comparative religious studies and is pursuing a doctorate in science and technology studies, exploring how philosophy, technology, religious traditions, public policy, and social implications all overlap. Damien works to explore the ontological and epistemological status of how human and nonhuman persons interface with technology. His research considers the public's values, intentions, and actual behaviours regarding genetic and biomechanical alterations and algorithmic systems, such as machine learning.",
    "Web Link 1": "http://www.afutureworththinkingabout.com/",
    "Web Link 2": "https://twitter.com/Wolven"
  },
  {
    "Name": "Melissa Wilson Sayres",
    "Bio": "Melissa Wilson Sayres is an evolutionary and computational biologist. She uses bioinformatics and genomics to study sex-biased processes including: the evolutionary dynamics of sex chromosomes, male mutation bias, and pregnancy. Her work has shown that more mutations are inherited through the male germline (sperm) than through the female germline (egg) in all mammalian species, and that although the human Y chromosome has shrunk significantly, the content on the Y chromosome is important.",
    "Web Link 1": "http://www.wilsonsayreslab.org/",
    "Web Link 2": "https://twitter.com/mwilsonsayres"
  },
  {
    "Name": "Stephani Etheridge Woodson",
    "Bio": "Stephani Etheridge Woodson is a Professor in the School of Film, Dance and Theatre at Arizona State University, where she specializes in community cultural development and community engaged practices. Her research and creative interests focus on theatre and performance with, by, and for children and youth; representational ethics; arts in wellness practices; children's media environments, and the group creation and performance of original work. She is also the director of ASU's MFA and Ph.D. programs in Theatre for Young Audiences. She is the co-editor, with Tamara Underiner, of the book Theatre, Performance and Change (2018).",
    "Web Link 1": "https://herbergerinstitute.asu.edu/profile/stephani-etheridge-woodson",
    "Web Link 2": "https://www.palgrave.com/us/book/9783319658278"
  },
  {
    "Name": "Lisa Yaszek",
    "Bio": "Lisa Yaszek is Professor and Associate Chair of School of Literature, Media, and Communication at Georgia Tech. Her research interests include science fiction, cultural history, gender studies, critical race studies, and science and technology studies.  Her essays on science fiction as a global language crossing centuries, cultures and continents appear in journals including Extrapolation, NWSA Journal, and Rethinking History. Her books include Galactic Suburbia: Recovering Women's Science Fiction (2008); Practicing Science Fiction: Critical Essays on Writing, Reading and Teaching the Genre (2010); and Sisters of Tomorrow: The First Women of Science Fiction (2016).",
    "Web Link 1": "http://pwp.gatech.edu/lyaszek/",
    "Web Link 2": "http://scifi.lmc.gatech.edu/"
  }
]